a = (input('Введите первый цвет (красный, желтый, синий): '))
b = (input('Введите второй цвет (красный, желтый, синий): '))

if (a.lower() == 'красный' or a.lower() == 'желтый') and (b.lower() == "желтый" or b.lower() == 'красный'):
    print('Оранжевый!')
elif (a.lower() == 'красный' or a.lower() == 'синий') and (b.lower() == "синий" or b.lower() == 'красный'):
    print('Фиолетовый!')
elif (a.lower() == 'синий' or a.lower() == 'желтый') and (b.lower() == "желтый" or b.lower() == 'синий'):
    print("Зелёный")
